read_verilog assign.v
synth_ice40 -top top
write_json assign.json
